src/Documents/Scan_Калькуляция/Scan_Калькуляция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_Калькуляция</name>
  <basedOn>Document.Scan_Калькуляция</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторПрайсЛиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПрайсЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетСPartPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентDealerNet</name>
    <type>
      <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентRetailPrice</name>
    <type>
      <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыКалькуляций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_Калькуляция</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НерасчетныеСоставляющие</name>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>Принадлежность</name>
      <type>
        <types>EnumRef.Scan_ПринадлежностьСоставляющихКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиКалькуляции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставляющаяРасчета</name>
      <type>
        <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеСоставляющие</name>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>Принадлежность</name>
      <type>
        <types>EnumRef.Scan_ПринадлежностьСоставляющихКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиКалькуляции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставляющаяРасчета</name>
      <type>
        <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартныеСпецификации</name>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБазовыхОпций</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьНадстройки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьОборудования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_Калькуляция/ManagerModule.bsl
// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.СтандартныеСпецификации.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()


// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

Функция ПолучитьСписокЭлементовДляНастройки() Экспорт
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	ТаблицаЭлементов.Колонки.Добавить("ИмяЭлемента",ОписаниеТиповС,,);
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ФормаКоманднаяПанель"); //rarus agar 14.07.2020  15690 +-
	МассивЭлементов.Добавить("ВыборХозОперации");
	МассивЭлементов.Добавить("ФормаСоздатьНаОсновании");
	МассивЭлементов.Добавить("ДействияФормы");
	МассивЭлементов.Добавить("ГруппаСлужебныеПоля");
	МассивЭлементов.Добавить("Статус");
	МассивЭлементов.Добавить("СтатусУтвердить");
	МассивЭлементов.Добавить("СтатусИзменить"); //rarus agar 14.07.2020  15690 +-
	МассивЭлементов.Добавить("СтатусСогласовать");
	МассивЭлементов.Добавить("СтатусПрерватьСогласование"); //rarus agar 14.07.2020  15690 +-
	МассивЭлементов.Добавить("СтатусЗавершить");
	МассивЭлементов.Добавить("СтатусАннулировать");
	МассивЭлементов.Добавить("ИдентификаторПрайсЛиста");
	МассивЭлементов.Добавить("НаименованиеПрайсЛиста");
	МассивЭлементов.Добавить("ДействуетСДаты");
	МассивЭлементов.Добавить("ДействуетСPartPeriod");
	МассивЭлементов.Добавить("СтраницаКалькуляция");
	МассивЭлементов.Добавить("РежимКалькуляции");
	МассивЭлементов.Добавить("ГруппаКомандыКалькуляции");
	МассивЭлементов.Добавить("КалькуляцияНачальноеЗаполнение");
	МассивЭлементов.Добавить("КалькуляцияПерезаполнить");
	МассивЭлементов.Добавить("КалькуляцияСохранить");
	МассивЭлементов.Добавить("ГруппаКалькуляцияПересчитать");
	МассивЭлементов.Добавить("КалькуляцияПересчитать");
	МассивЭлементов.Добавить("КалькуляцияПересчитатьРаздел");
	МассивЭлементов.Добавить("ГруппаКалькуляцияОчистить");
	МассивЭлементов.Добавить("КалькуляцияОчистить");
	МассивЭлементов.Добавить("КалькуляцияОчиститьРаздел");
	МассивЭлементов.Добавить("ГруппаБыстрыеДействия");
	МассивЭлементов.Добавить("КалькуляцияЗаполнитьЗначенияСправа");
	МассивЭлементов.Добавить("КалькуляцияТабличныйДокумент");
	МассивЭлементов.Добавить("НерасчетныеСоставляющие");
	МассивЭлементов.Добавить("РасчетныеСоставляющие");
	МассивЭлементов.Добавить("СтандартныеСпецификации");
	МассивЭлементов.Добавить("ТекущийРазделКалькуляции");
	МассивЭлементов.Добавить("СтраницаСогласование");
	МассивЭлементов.Добавить("РезультатСогласования");
	МассивЭлементов.Добавить("Согласование"); //rarus agar 14.07.2020  15690 +-
	МассивЭлементов.Добавить("ХодСогласования");
	МассивЭлементов.Добавить("СтраницаСистемныеПоля");
	МассивЭлементов.Добавить("ДокументОснование");
	МассивЭлементов.Добавить("СтраницаКомментарий");
	МассивЭлементов.Добавить("Комментарий");
	
	Для Каждого ИмяЭлемента Из МассивЭлементов Цикл
		СтрокаЭлемента = ТаблицаЭлементов.Добавить();
		СтрокаЭлемента.ИмяЭлемента = ИмяЭлемента;
	КонецЦикла;
	
	Возврат ТаблицаЭлементов;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ХозОперация");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 от %3'; en = 'STD %1 %2 dated %3'"),
	Данные.ХозОперация, Данные.Номер, Данные.Дата);
	
КонецПроцедуры
